tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_external_plume/system/blockMeshDict
/* Case B 2-D external-plume domain.
   The hydraulic tower keeps the area-equivalent planar width W=Dt^2/D.
   Its solid sidewalls end at the experimental rim y=0.657 m. Above that
   rim, a 0.24 m wide by 0.60 m high atmospheric box lets discharged water
   expand as a free planar jet instead of remaining in an artificial duct. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;

// D=0.094 m; Dt=0.0127 m; W=Dt^2/D=0.0017159574 m.
// Physical tower: x=[3.5151420213,3.5168579787], crown y=0.047,
// open rim y=0.657. Exterior atmosphere: x=[3.396,3.636],
// y=[0.657,1.257].
vertices
(
    // Horizontal pipe, z=-0.002 / +0.002.
    (0           -0.047 -0.002) // 0
    (0            0.047 -0.002) // 1
    (0           -0.047  0.002) // 2
    (0            0.047  0.002) // 3
    (0.546       -0.047 -0.002) // 4
    (0.546        0.047 -0.002) // 5
    (0.546       -0.047  0.002) // 6
    (0.546        0.047  0.002) // 7
    (3.5151420213 -0.047 -0.002) // 8
    (3.5151420213  0.047 -0.002) // 9
    (3.5151420213 -0.047  0.002) // 10
    (3.5151420213  0.047  0.002) // 11
    (3.5168579787 -0.047 -0.002) // 12
    (3.5168579787  0.047 -0.002) // 13
    (3.5168579787 -0.047  0.002) // 14
    (3.5168579787  0.047  0.002) // 15
    (4.006       -0.047 -0.002) // 16
    (4.006        0.047 -0.002) // 17
    (4.006       -0.047  0.002) // 18
    (4.006        0.047  0.002) // 19

    // Physical open rim.
    (3.5151420213  0.657 -0.002) // 20
    (3.5151420213  0.657  0.002) // 21
    (3.5168579787  0.657 -0.002) // 22
    (3.5168579787  0.657  0.002) // 23

    // Exterior-box lower outer corners at rim elevation.
    (3.396         0.657 -0.002) // 24
    (3.396         0.657  0.002) // 25
    (3.636         0.657 -0.002) // 26
    (3.636         0.657  0.002) // 27

    // Exterior-box top vertices.
    (3.396         1.257 -0.002) // 28
    (3.396         1.257  0.002) // 29
    (3.5151420213  1.257 -0.002) // 30
    (3.5151420213  1.257  0.002) // 31
    (3.5168579787  1.257 -0.002) // 32
    (3.5168579787  1.257  0.002) // 33
    (3.636         1.257 -0.002) // 34
    (3.636         1.257  0.002) // 35
);

blocks
(
    // Horizontal pipe: unchanged axial and vertical resolution.
    hex (0 4 5 1 2 6 7 3)           (160 28 1) simpleGrading (1 1 1)
    hex (4 8 9 5 6 10 11 7)         (860 28 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11)     (10  28 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15)   (140 28 1) simpleGrading (1 1 1)

    // Physical tower only, crown to open rim.
    hex (9 13 22 20 11 15 23 21)    (10 268 1) simpleGrading (1 1 1)

    // External atmosphere above the rim. Side blocks are graded toward the
    // jet; all three blocks are graded from a fine rim region to a coarser top.
    hex (24 20 30 28 25 21 31 29)   (45 180 1) simpleGrading (0.2 1.5 1)
    hex (20 22 32 30 21 23 33 31)   (10 180 1) simpleGrading (1   1.5 1)
    hex (22 26 34 32 23 27 35 33)   (45 180 1) simpleGrading (5   1.5 1)
);

edges ();

boundary
(
    walls
    {
        type wall;
        faces
        (
            // Horizontal-pipe ends and walls; crown is open at the tee.
            (0 2 3 1) (17 19 18 16)
            (4 6 2 0) (8 10 6 4) (12 14 10 8) (16 18 14 12)
            (1 3 7 5) (5 7 11 9) (13 15 19 17)

            // Tower sidewalls terminate at the physical rim.
            (9 11 21 20) (22 23 15 13)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            // Open/draining lower truncation outside the tower mouth.
            (20 21 25 24) (26 27 23 22)

            // Exterior sides and top.
            (24 25 29 28) (34 35 27 26)
            (28 29 31 30) (30 31 33 32) (32 33 35 34)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // Horizontal pipe.
            (0 1 5 4) (2 6 7 3)
            (4 5 9 8) (6 10 11 7)
            (8 9 13 12) (10 14 15 11)
            (12 13 17 16) (14 18 19 15)

            // Physical tower and external box.
            (9 13 22 20) (11 15 23 21)
            (24 20 30 28) (25 21 31 29)
            (20 22 32 30) (21 23 33 31)
            (22 26 34 32) (23 27 35 33)
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
